import 'dart:math';

String randomAlamatUtil() {
  var data = [
    "Парктыкы, 10, Тегалрејо, Семаранг Тенга, Семаранг, Жава Тенга, 50126"
        "Кусума Бангса, 25, Пандеан, Мадиун, Мадиун, Жава Тимур, 63123"
        "Судирман Бару, 15, Карангкыдул, Боёлалы, Боёлалы, Жава Тенга, 57312"
        "Дипонегоро, 7, Банюманик, Семаранг Жыгыш, Семаранг, Жава Тенга, 50269"
        "Аржуна Тимур, 42, Пучанг Аном, Кедири, Кедири, Жава Тимур, 64128"
        "Ветеран, 33, Можореджо, Сидоарджо, Сидоарджо, Жава Тимур, 61212"
        "Кави Барат, 19, Кепанджен, Кепанджен, Маланг, Жава Тимур, 65163"
        "Мербабу Утара, 12, Чанди, Магеланг Утара, Магеланг, Жава Тенга, 56126"
        "Др. Ваһидин Судирохусодо, 5, Семангги, Салатига, Салатига, Жава Тенга, 50727"
        "Имам Бонжол, 8, Тлогосари, Семаранг Утура, Семаранг, Жава Тенга, 50134"
        "Картини, 14, Нгестихаржо, Салатига, Салатига, Жава Тенга, 50711"
        "Кертанегара, 29, Можоагунг, Жомбанг, Жомбанг, Жава Тимур, 61482"
        "Ахмад Яни, 17, Клатен Селатан, Клатен Селатан, Клатен, Жава Тенга, 57433"
        "Дипонегоро, 23, Можолангу, Лоуоквару, Маланг, Жава Тимур, 65142"
        "Гаджа Мада, 11, Глагахсари, Каранганяр, Каранганяр, Жава Тенга, 57711"
        "Теуку Умар, 32, Банкалсари, Тегал, Тегал, Жава Тенга, 52127"
        "Дипонегоро, 6, Котабар",
  ];

  var random = Random();
  var randomIndex = random.nextInt(data.length);

  return data[randomIndex];
}

String getKotaFromAlamatUtil(String data) {
  var alamatParts = data.split(', ');
  if (alamatParts.length > 3) {
    return alamatParts[3];
  } else {
    return "Tidak Dapat Memperoleh Nama Kota";
  }
}

String randomNameHotelUtil() {
  var data = [
    "Ош-Нуру",
    "Rayan Hotel",
    "Этно",
    "ORIENT",
    "Osh Grand Hotel Chavo",
    "Орто Азия",
    "JANNAT HOTEL & RESORT",
  ];

  var random = Random();
  var randomIndex = random.nextInt(data.length);

  return data[randomIndex];
}
